Documents/ЛБ_ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриходныйКассовыйОрдер</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПКО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераПКО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменитьОперациюПКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоЗаймуПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплатыПоЗаймуПереоформлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИзКассыДругогоЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИзЦентральнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСКорпоративнойКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеИзлишков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗарплатыПоОшибке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеУщербаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеУщербаУволеннымСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеНедостачиСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеНедостачиУволеннымСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПриходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступленияОтПокупателейНевостребованныхЗалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйПКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_КассоваяСменаСтатус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КассоваяСменаСтатус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйДеньЗакрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;

	Если Параметры.Свойство("КопироватьИзДокумента") Тогда 
		ЗаполнитьДокументКопированием(Параметры.КопироватьИзДокумента);
		Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	 		 
		НовыйДокумент = Истина;          	
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Если Параметры.Свойство("Организация") Тогда 
			Объект.Организация = Параметры.Организация;
		Иначе	
		    Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
		КонецЕсли;	
		Если Параметры.Свойство("Ломбард") Тогда 
			Объект.Ломбард = Параметры.Ломбард;
		Иначе	
		     Объект.Ломбард = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь); 
		КонецЕсли;	   
	    Если НЕ ТекПользователь.ЭтоЛомбард Тогда
       		Объект.Ответственный = ТекПользователь;
		Иначе
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;	 	 		 
		НовыйДокумент = Истина;  
	//Иначе
	//	ЭтаФорма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;	 
	
	Если ПроверитьКассовыйДеньЗакрыт() Тогда
		Этаформа.ТолькоПросмотр = Истина;
	Иначе	
		Если Объект.Проведен Тогда  
			Этаформа.ТолькоПросмотр = Истина; 
			Если НЕ ЛБ_ОбщийМодуль.ПроверитьЕстьОтменаКО(Объект.Ссылка) Тогда
				Если НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков И 
					 НЕ Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО Тогда 
					 
					Если ЛБ_ОбщийМодуль.КассовыеСменаСовпадаетСТекущей(Объект) Тогда
						Если ТекущаяДатаСеанса() - Объект.Дата < 3600 Тогда  
							ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактировать.Видимость = Истина;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	  
			КонецЕсли;	
		КонецЕсли; 
	КонецЕсли;	
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	УстановитьВидимостьПоВидуОперации();  
	УстановитьСтатусДокумента(); 
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда  
		ОтделениеЛомбарда = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), Объект.Ломбард); 
	КонецЕсли;	   
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков") ИЛИ
	     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником") Тогда 			                                            
	   Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Элементы.ПринятоОт.ТолькоПросмотр = Истина;  
	   КонецЕсли;	   
   КонецЕсли;   
   
   Если НЕ ТекПользователь.ЭтоЛомбард Тогда
	   Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		   СотрудникЦО = Истина;
	   КонецЕсли;
   КонецЕсли;	   
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДокументКопированием(ИзДокумента);
	Для каждого Реквизит Из Метаданные.Документы.ЛБ_ПриходныйКассовыйОрдер.Реквизиты Цикл 
		Объект[Реквизит.Имя] = ИзДокумента[Реквизит.Имя];
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НовыйДокумент Тогда
		СформироватьНомерДокумента(); 
		ЭтаФорма.Заголовок = "Приходный кассовый ордер (создание)";
	Иначе
		ЭтаФорма.Заголовок = "Приходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераПКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.СводныйПКО") Тогда
			Элементы.ГруппаОсновная.Видимость = Ложь;
			Элементы.ГруппаРеквизиты.Видимость = ложь; 
			Элементы.ВидОперации.Видимость = Ложь;
			ЭтаФорма.ТолькоПросмотр = Истина;  
			ЭтаФорма.Заголовок = "Сводный приходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераПКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ПолучитьОткрытуюКассовуюСмену()
	Возврат ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(?(НовыйДокумент И НЕ СотрудникЦО, ТекущаяДатаСеанса(), Объект.Дата), Объект.Организация, Объект.Ломбард);
КонецФункции      

&НаСервере
Функция ПроверитьКассовыйДеньЗакрыт()
	СтруктураКС = ЛБ_ОбщийМодуль.ПолучитьТекущийСтатусКассовойСмены(КонецДня(Объект.Дата), Объект.Организация, Объект.Ломбард);
	Если НЕ СтруктураКС = неопределено Тогда
		Если СтруктураКС.Статус = Перечисления.ЛБ_КассоваяСменаСтатус.КассовыйДеньЗакрыт Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда   
		СтруктураКС = ПолучитьОткрытуюКассовуюСмену();
		Если СтруктураКС = неопределено Тогда
			Отказ = Истина;
			Сообщить("Необходимо открыть кассовую смену в ломбарде!");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьСтатусДокумента()  
	Если Объект.Проведен Тогда 
		ЭтаФорма.СтатусДокумента = "ФАКТ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		ЭтаФорма.СтатусДокумента = "ПРОЕКТ"; 
		Элементы.СтатусДокумента.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьНомерДокумента()  
	Объект.НомерПКО = ЛБ_УправлениеЛомбардом.ПолучитьНовыйНомерПКО(Объект.Дата, Объект.Организация, Объект.Ломбард);
	Если Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
		Объект.ПредставлениеНомераПКО = Строка(Объект.НомерПКО);
	Иначе	
	    Объект.ПредставлениеНомераПКО = СокрЛП(Объект.Ломбард.НомерЛомбарда) + "/" + СокрЛП(Объект.НомерПКО);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоВидуОперации() 
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты Тогда
		Элементы.БанковскаяКарта.Видимость = Истина;
	Иначе
		Элементы.БанковскаяКарта.Видимость = Ложь; 	
	КонецЕсли;	 
	
	//Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиУволеннымСотрудником ИЛИ 
	//	 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеУщербаУволеннымСотрудником ИЛИ
	//	 (Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО ИЛИ 
	//	 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО И НЕ ТипКонтрагентаКлиент(Объект.Контрагент) Тогда
	//	Элементы.ДУЛ.РедактированиеТекста = Истина; 		
	//Иначе
	//	Элементы.ДУЛ.РедактированиеТекста = Ложь; 
	//КонецЕсли;	

	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы ИЛИ  
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты ИЛИ 
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ВозвратОтПодотчетника ИЛИ  
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником ИЛИ
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов Тогда   
		Элементы.Основание.ТолькоПросмотр = Истина; 
	Иначе  
		Элементы.Основание.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов Тогда 
		Элементы.ДополнительнаяИнформация.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда Или 
		 Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы Тогда
		Элементы.ПринятоОт.ТолькоПросмотр = Ложь; 
	Иначе
		Элементы.ПринятоОт.ТолькоПросмотр = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию() 
	Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Объект.ВидОперации);
	Объект.Дт = Результат.Дт;
    Объект.Кт = Результат.Кт;
	
    Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы Тогда
	   Объект.Контрагент = Справочники.ЛБ_Ломбарды.ЦентральныйОфис;  
	   Элементы.Контрагент.ТолькоПросмотр = Истина;
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков ИЛИ
	          Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником ИЛИ
			  Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов Тогда 			  
       Объект.Контрагент = Объект.Ответственный.ФизическоеЛицо;                                        
	   Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		   Объект.ФизическоеЛицо = Объект.Контрагент;
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Объект.ПринятоОт = СокрЛП(Объект.Контрагент);
		   Элементы.ПринятоОт.ТолькоПросмотр = Истина; 
       КонецЕсли;	   
    Иначе                                          
	   Элементы.Контрагент.ТолькоПросмотр = Ложь;
    КонецЕсли;
КонецПроцедуры    

&НаСервере
Функция ДокументФизЛица()   
	//+МАН 23.04.25 Приведение наименования к единому написанию. Заявка 2956
	//Было: Информация = "Паспорт РФ";
	Информация = "Паспорт гражданина РФ";
	//-МАН
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.ФизическоеЛицо); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Гражданство КАК Гражданство,
	               |	ФизическиеЛица.СерияДокумента КАК СерияДокумента,
	               |	ФизическиеЛица.НомерДокумента КАК НомерДокумента,
	               |	ФизическиеЛица.КемВыданДокумент КАК КемВыданДокумент,
	               |	ФизическиеЛица.КодПодразделенияДокумента КАК КодПодразделенияДокумента,
	               |	ФизическиеЛица.ДатаВыдачиДокумента КАК ДатаВыдачиДокумента
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.СерияДокумента), " " + СокрЛП(Выборка.СерияДокумента), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.НомерДокумента), " " + СокрЛП(Выборка.НомерДокумента), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.КемВыданДокумент), " выдан " + СокрЛП(Выборка.КемВыданДокумент), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДатаВыдачиДокумента), " " + Формат(Выборка.ДатаВыдачиДокумента,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.КодПодразделенияДокумента), " код подр. " + СокрЛП(Выборка.КодПодразделенияДокумента), "");
	КонецЕсли;     
		
	Возврат Информация;
КонецФункции

&НаСервере
Функция ДокументКлиентаВСтроку(Документ)  
	Если ЗначениеЗаполнено(Документ) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));  
		Запрос.УстановитьПараметр("ДокументЗалогодателя", Документ);
		Запрос.Текст = "ВЫБРАТЬ
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
			               |ИЗ
			               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
			               |			&Дата,
			               |			ДокументЗалогодателя = &ДокументЗалогодателя
			               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Информация = "";
			Информация = СокрЛП(Выборка.ВидДокумента);
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
			Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
			Возврат Информация;
		КонецЕсли;  
	КонецЕсли;	
	Возврат	"";	
КонецФункции  

&НаСервере
Функция ФИО(Клиент) 
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент); 
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
		               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
		               |ИЗ
		               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Клиент) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		КонецЕсли; 
	КонецЕсли;	
	Возврат "";
КонецФункции	

&НаСервере
Функция ПолучитьОсновнойДУЛ(Клиент) 
	Если ЗначениеЗаполнено(Клиент) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент); 
		Запрос.УстановитьПараметр("Дата", ?(НовыйДокумент, ТекущаяДатаСеанса(), Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументЗалогодателя КАК ДокументЗалогодателя
		               |ИЗ
		               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(
		               |			&Дата,
		               |			ДокументЗалогодателя.Владелец = &Клиент
		               |				И ОсновнойДУЛ = ИСТИНА) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ДокументЗалогодателя;
		КонецЕсли;     
	КонецЕсли;	
	Возврат Справочники.ЛБ_ДокументыЗалогодателя.ПустаяСсылка();
КонецФункции      


&НаСервере
Процедура ЗаполнитьДопРеквизиты()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы Тогда
        Объект.Основание = "Передача денежных средств между операционной и центральной кассами"; 
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда Тогда  
		НомерЛомбарда = ?(ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ЛБ_Ломбарды"), СокрЛП(Объект.Контрагент.НомерЛомбарда), "");
        Объект.Основание = "Передача денежных средств из кассы ломбарда № " + НомерЛомбарда + " на ссудно-залоговые операции"; 
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";   
    ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты Тогда
        Объект.Основание = "Получение наличных в банкомате для выдачи займов"; 
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "Чек № ____ от ________"; 
		Объект.ДополнительнаяИнформация = "Чек № ____ от ________";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков Тогда
        Объект.Основание = "Излишки по результатам пересчета денежных средств";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";	 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ВозвратОтПодотчетника Тогда
        Объект.Основание = "Возврат подотчетных средств";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";	  	
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ВозвратЗарплатыПоОшибке Тогда
        Объект.Основание = "Возврат ошибочно полученной суммы заработной платы за ________"; 
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеУщербаСотрудником Тогда
        Объект.Основание = "Погашение ущерба по акту"; 
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = "Возмещение ущерба по соглашению"; 
		Объект.ДополнительнаяИнформация = "Возмещение ущерба по соглашению"; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником Тогда
        Объект.Основание = "Погашение недостачи по результатам пересчета денежных средств";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Приложение = ""; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеУщербаУволеннымСотрудником Тогда
        Объект.Основание = "Погашение ущерба по акту"; 
	    Объект.Приложение = "Возмещение ущерба по соглашению";  
		//+МАН 23.04.25 Замена открытия спр физ. лиц на поиск клиента. Заявка 2956
		//Было: Объект.ДУЛ = ДокументФизЛица();
		Если Объект.Контрагент = Неопределено Тогда
			Объект.ДУЛ = "";
		Иначе
			Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента);
		КонецЕсли;
		//-МАН
		Объект.ДополнительнаяИнформация = "Возмещение ущерба по соглашению";
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиУволеннымСотрудником Тогда
        Объект.Основание = "Погашение недостачи по результатам пересчета денежных средств";  
		//+МАН 23.04.25 Замена открытия спр физ. лиц на поиск клиента. Заявка 2956
		//Было: Объект.ДУЛ = ДокументФизЛица();
		Если Объект.Контрагент = Неопределено Тогда
			Объект.ДУЛ = "";
		Иначе
			Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента);
		КонецЕсли;
		//-МАН
	    Объект.Приложение = "";  
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов Тогда 
		Объект.ПринятоОт = "Покупателей невостребованных залогов с применением ККТ";
		Объект.ДУЛ = ДокументФизЛица();
	    Объект.Основание = "Поступления от покупателей НЗ за " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
		Объект.Приложение = "Отчет о состоянии счетчиков ККТ с гашением, " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy"); 
		Объект.ДополнительнаяИнформация = Объект.Приложение;
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО ИЛИ 
		      Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО Тогда  
		Если ТипКонтрагентаКлиент(Объект.Контрагент) Тогда 
			Объект.ПринятоОт = ФИО(Объект.Контрагент);
	        Объект.Основание = ""; 
		    Объект.Приложение = "";
			Объект.ДУЛ = ДокументКлиентаВСтроку(Объект.ДокументКлиента); 
		Иначе	
	        Объект.Основание = ""; 
		    Объект.Приложение = "";
			Объект.ДУЛ = ДокументФизЛица(); 
		КонецЕсли;		
    КонецЕсли;	   
КонецПроцедуры

&НаСервере
Процедура ОчиститьПлательщика()  		
	Объект.Контрагент = неопределено;  
	Объект.ПринятоОт = "";
	Объект.ДУЛ = "";
	Объект.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	Объект.ДополнительнаяИнформация = "";
	Объект.Приложение = "";
	Объект.Основание = "";
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	УстановитьВидимостьПоВидуОперации(); 
	ОчиститьПлательщика();
	ЗаполнитьЗначенияПоУмолчанию(); 
	ЗаполнитьДопРеквизиты();	         	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардыОтделения() 
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардыВОтделении(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), ОтделениеЛомбарда, Объект.Ломбард); 
КонецФункции

&НаСервере
Функция ТипКонтрагентаКлиент(Контрагент)
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.ЛБ_Залогодатели") Тогда
	    Возврат Истина;
	КонецЕсли;	       
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь; 
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Предупреждение("Выберите вид операции!", 60);
		Возврат
	КонецЕсли;	
	 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПлательщика",ЭтаФорма);
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда") Или 
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы") Тогда
		Если ЗначениеЗаполнено(ОтделениеЛомбарда) И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда") Тогда 
			СписокВыбора = ПолучитьЛомбардыОтделения(); 
			ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.Контрагент); 

			Если ВыбранноеЗначение <> Неопределено Тогда 
			   Объект.Контрагент = ВыбранноеЗначение.Значение;
			   ЗаполнитьДопРеквизиты();
			КонецЕсли;  
		Иначе	  
		    ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
		КонецЕсли;	 
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО") ИЛИ
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО") Тогда
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(1, "Клиент");
		СписокВыбора.Добавить(2, "Физическое лицо");
		ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, Элементы.Контрагент); 
		
		Если ВыбранноеЗначение <> Неопределено Тогда  
			Если ВыбранноеЗначение.Значение = 1 Тогда   
				ПараметрыФормы = Новый Структура;  
				Если ЗначениеЗаполнено(Объект.Контрагент) И ТипКонтрагентаКлиент(Объект.Контрагент) Тогда 
					ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент); 
				КонецЕсли;	
				ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			ИначеЕсли ВыбранноеЗначение.Значение = 2 Тогда
				ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты") ИЛИ
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ВозвратОтПодотчетника") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ВозвратЗарплатыПоОшибке") или
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеУщербаСотрудником") Тогда
		
		массивСотрудников = СформироватьМассивСотрудниковОтделения();    		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", массивСотрудников);
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);

		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрФормы,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		

	//+МАН 23.04.25 Замена открытия спр физ. лиц на поиск клиента. Заявка 2956
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеУщербаУволеннымСотрудником")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиУволеннымСотрудником") Тогда
		
		ОткрытьФорму("ОбщаяФорма.ЛБ_ПоискЗалогодателя",, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//-МАН
	Иначе 
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	КонецЕсли;	 
КонецПроцедуры

Функция СформироватьМассивСотрудниковОтделения() 
	
	ТекДата = ТекущаяДата();
	массив = Новый Массив;
	
	Запрос0 = Новый Запрос;
	Запрос0.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&НаДату, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
	               |ГДЕ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард = &Ломбард"; 
	Запрос0.УстановитьПараметр("НаДату", ТекДата);
	Запрос0.УстановитьПараметр("Ломбард", Объект.Ломбард); 
	
	Отделен = Неопределено;
	Выборка = Запрос0.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отделен = Выборка.Отделение;
	КонецЕсли;  
	
	Если Отделен <> Неопределено Тогда
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
	               |			&НаДату,
	               |			Отделение = &Отделение
	               |				И Ломбард.Закрыт = ЛОЖЬ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних"; 
	Запрос.УстановитьПараметр("НаДату", ТекДата);
	Запрос.УстановитьПараметр("Отделение", Отделен);

	тз = Запрос.Выполнить().Выгрузить(); 
	массивЛомб = тз.ВыгрузитьКолонку("Ссылка");	
	
				   
	
	Запрос2 = Новый Запрос; 
	Запрос2.Текст = "ВЫБРАТЬ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Ломбард,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия,
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
	                |ИЗ
	                |	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
	                |ГДЕ
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение В(&Подразделение)
	                |	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &ВидСобытия
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение.НомерЛомбарда";
	Запрос2.УстановитьПараметр("НаДату", ТекДата);
	Запрос2.УстановитьПараметр("Подразделение", массивЛомб); 
	Запрос2.УстановитьПараметр("ВидСобытия", Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение);
	         	

	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидСобытия = Перечисления.ЛБ_ВидыКадровыхСобытий.Увольнение Тогда
			Продолжить;
		КонецЕсли;
		массив.Добавить(Выборка.ФизическоеЛицо);
		
	КонецЦикла;
	КонецЕсли;

	Возврат Массив;

КонецФункции


&НаСервере
Процедура ПослеВыбораПлательщика(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Объект.Контрагент = Результат.Залогодатель;
		Объект.ФизическоеЛицо = Результат.Залогодатель;
		Объект.ДокументКлиента = Результат.ДокументЗалогодателя; 
		//+МАН 23.04.25 Заполняем от кого принято. Заявка 2956
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеУщербаУволеннымСотрудником")
			ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиУволеннымСотрудником") Тогда

			Объект.ПринятоОт = СокрЛП(Результат.Залогодатель.Наименование);
		КонецЕсли;
		//-МАН
	Иначе	
		Объект.Контрагент = Результат;  
		Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
			Объект.ФизическоеЛицо = Результат;
			Объект.ПринятоОт = СокрЛП(Результат);
		КонецЕсли;	 
	КонецЕсли;	
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСтатусДокумента(); 
КонецПроцедуры

&НаКлиенте
Процедура ПринятоОтНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеИзКассыДругогоЛомбарда") или 
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеИзЦентральнойКассы") Тогда
		
		массивСотрудников = СформироватьМассивСотрудниковОтделения();    		
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ссылка", массивСотрудников);
		
		ПараметрФормы = Новый Структура;
		ПараметрФормы.Вставить("Отбор", СтруктураОтбора);
		
		ОбработкаВыбораФЛ = Новый ОписаниеОповещения("ПослеВыбораФЛ",ЭтаФорма);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрФормы,ЭтаФорма,,,, ОбработкаВыбораФЛ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ОбработкаВыбораФЛ = Новый ОписаниеОповещения("ПослеВыбораФЛ",ЭтаФорма);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",,ЭтаФорма,,,, ОбработкаВыбораФЛ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ПослеВыбораФЛ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.ФизическоеЛицо = Результат;
	Объект.ПринятоОт = СокрЛП(Результат);    
	Элементы.ПринятоОт.РедактированиеТекста = Ложь; 
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаСервере
Функция ПолучитьОтделение()
	Возврат ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса()), Объект.Ломбард);
КонецФункции

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ОтделениеЛомбарда = ПолучитьОтделение();
	СформироватьНомерДокумента(); 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		ЭтаФорма.Заголовок = "Приходный кассовый ордер № " + СокрЛП(Объект.ПредставлениеНомераПКО) + " от " + Формат(Объект.Дата, "ДЛФ=DT");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринятоОтПриИзменении(Элемент)
	ЗаполнитьДопРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура ПринятоОтОчистка(Элемент, СтандартнаяОбработка)
	Объект.ФизическоеЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");  
	Элементы.ПринятоОт.РедактированиеТекста = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущуюДатуСеанса()
	Возврат ТекущаяДатаСеанса();
КонецФункции	

&НаКлиенте
Процедура БанковскаяКартаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораБК = Новый ОписаниеОповещения("ПослеВыбораБК",ЭтаФорма);
	ПараметрыФормы = Новый Структура; 
	Отделение = ПолучитьОтделение();
	Если Отделение = неопределено Тогда
		ПараметрыФормы.Вставить("ВыборОтделение", Ложь);
	Иначе	                    
		ПараметрыФормы.Вставить("ВыборОтделение", Истина);
	    ПараметрыФормы.Вставить("Отделение", Отделение);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ТекДата", ?(НовыйДокумент, ПолучитьТекущуюДатуСеанса(), Объект.Дата));
	ОткрытьФорму("Справочник.ЛБ_КорпоративныеКарты.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбораБК, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораБК(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;	 
	
	Объект.БанковскаяКарта = Результат;
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведение()  
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	ЭтаФорма.ТолькоПросмотр = Ложь;
	ОтменитьПроведение();
	УстановитьСтатусДокумента(); 
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаРедактировать.Видимость = Ложь; 
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ОприходованиеИзлишков") ИЛИ
	     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеНедостачиСотрудником") Тогда 			                                            
	   Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		   Элементы.Контрагент.ТолькоПросмотр = Истина; 
		   Элементы.ПринятоОт.ТолькоПросмотр = Истина;  
	   КонецЕсли;	   
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеУщербаСотрудником") ИЛИ
		 Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПогашениеУщербаУволеннымСотрудником") Тогда
	    Объект.Приложение = Объект.ДополнительнаяИнформация;  
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	Если (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПриходныеОперацииПоСогласованиюСЦО") ИЛИ 
		       Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПКО.ПрочиеПриходныеОперацииПоСогласованиюСЦО")) И ТипКонтрагентаКлиент(Объект.Контрагент) Тогда
		СтандартнаяОбработка = Ложь; 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Залогодатель", Объект.Контрагент);
		ПараметрыФормы.Вставить("Дата", ?(НовыйДокумент, ПолучитьТекущуюДатуСеанса(), Объект.Дата));	
		ОткрытьФорму("ОбщаяФорма.ЛБ_КарточкаЗалогодателя", ПараметрыФормы, ЭтаФорма); 
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;	
КонецПроцедуры

//+МАН Выведена нестандартная кнопка печати. Заявка 2936
&НаКлиенте
Процедура Печать(Команда)
	Если Объект.Проведен Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "ПКО"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ПриходныйКассовыйОрдер");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,); 
	Иначе
		Предупреждение("Печать непроведенного документа запрещена!");
	КонецЕсли;	
КонецПроцедуры
//-МАН
